app/controllers/doctors_controller.rb

SELECT * FROM `doctors` WHERE (`doctors`.`id` = 0)
---
        def index
               @doctors=Doctor.find(:all, :joins => "left join appointments on doctors.id  = appointments.doctor_id", :select => "doctors.*, count(appointments.id) as appointment_count", :group => "doctors.id")

INSERT INTO `doctors` (`doctor_name`, `no_of_appointments`, `patient_id`, `created_at`, `updated_at`, `appointment_id`) VALUES(NULL, NULL, NULL, '2011-05-27 04:14:50', '2011-05-27 04:14:50', NULL)
---
        def create
               # render :text => params.inspect and return false
                @doctor=Doctor.new(params[:doctor])
                if @doctor.save

SELECT * FROM `doctors` WHERE (`doctors`.`id` = 4)
---
        def show
                @doctor=Doctor.find(params[:id])