app/controllers/patients_controller.rb

        def create
                @patient=Patient.new(params[:patient])
               # render :text => params.inspect and return false
                if @patient.save
                        @patient.appointments.create(params[:appointment])
---
INSERT INTO `patients` (`patient_name`, `gender`, `age`, `disease`, `created_at`, `updated_at`, `doctor_name`, `appointment_date`) VALUES('bbb', 'Male', 60, 'bbbb', '2011-05-27 12:11:30', '2011-05-27 12:11:30', NULL, '2011-12-12')
INSERT INTO `appointments` (`doctor_id`, `patient_id`, `appointment_date`, `created_at`, `updated_at`) VALUES(NULL, 6, NULL, '2011-05-27 09:25:20', '2011-05-27 09:25:20')